<a href="https://colab.research.google.com/github/claudioaf/Python/blob/main/Selecionando_elementos_espec%C3%ADficos_em_um_dicion%C3%A1rio_de_dados.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

###Vamos utilizar o Script abaixo para selecionar elementos em um dicionário de dados a partir de determinado critério

In [4]:
# Criando o dicionário
dicionario ={
    1: 'manoel',
    2: 'paulo',
    3: 'ricardo',
    4: 'roberto',
    5: 'thiago',
    6: 'sofia',
    7: 'tereza',
    8: 'ana',
    9: 'manoela',
    10: 'eduardo',
    11: 'josé',
    12: 'adalberto',
    13: 'anibal',
    14: 'adriana',
    15: 'augusto',
    16: 'felipe',
    17: 'fernando',
    18: 'apolo',
    19: 'vinicius',
    20: 'andre',
    21: 'any',
    22: 'camila',
    23: 'andrea',
    24: 'juliana',
    25: 'italo',
    26: 'max'
}

### 1 - Selecionando dados a partir de critérios aplicados a um caractere numérico

2.1 - Criar um dicionário com o nomes cujo Id é maior ou igual a 20

In [ ]:
# Definindo o dicionário que receberá os dados filtrados
novo_dicionáio = dict()

# Iterando para obter os nomes cujo id é maior ou igual a 20
for (id, nome) in dicionario.items():
  if id >= 20:
    novo_dicionáio[id] = nome # Adicionando o Id e o nome ao novo dicionário

# Imprimir os nomes cujo Id é maior ou igual a 20
print(novo_dicionáio)

{20: 'andre', 21: 'any', 22: 'camila', 23: 'andrea', 24: 'juliana', 25: 'italo', 26: 'max'}

### 2 - Selecionando dados a partir de critérios aplicados a um texto

2.1 - Iniciando com a letra a

In [27]:
# Criar uma lista para armazenar os nomes iniciando com a letra a
nomes_inicio_a =[]

# Obtendo os nomes que iniciam com a letra a e gravando na lista 'nomes_inicio_a'
for (id,nomes) in dicionario.items():
  if dicionario[id][0] == "a": #[id]: indicará qual elemento será consultado no dicionário / [0]: seleciona o primiero elemento da string nome
    nomes_inicio_a.append(nomes)

nomes_inicio_a

['ana',
 'adalberto',
 'anibal',
 'adriana',
 'augusto',
 'apolo',
 'andre',
 'any',
 'andrea']

In [25]:
print(dicionario[1][1])

a

2.2 - A partir de determinado comprimento (Tamanho do nome)

2.2.1 - Verificando o tamanho de cada nome

In [ ]:
# Criar uma lista para armazenar o tamanho do nome
tamanho_lista = []

# Criar uma lista para armazenar o nome
nome_lista = []

# Otendo o tamanho do nome e gravando nas listas
for (id,nomes) in dicionario.items():
  tamanho = len(nomes)
  nome = nomes
  
  tamanho_lista.append(tamanho)
  nome_lista.append(nome)

# Criar um novo dicionário utilizando os itens das listas que criamos acima
nomes_tamanho = dict(zip(nome_lista,tamanho_lista))  
print(nomes_tamanho)

{'manoel': 6, 'paulo': 5, 'ricardo': 7, 'roberto': 7, 'thiago': 6, 'sofia': 5, 'tereza': 6, 'ana': 3, 'manoela': 7, 'eduardo': 7, 'josé': 4, 'adalberto': 9, 'anibal': 6, 'adriana': 7, 'augusto': 7, 'felipe': 6, 'fernando': 8, 'apolo': 5, 'vinicius': 8, 'andre': 5, 'any': 3, 'camila': 6, 'andrea': 6, 'juliana': 7, 'italo': 5, 'max': 3}

In [ ]:
# Biblioteca necessária para criar um dataframe com os dados do dicionário
import pandas as pd

# Criando o dataframe
dataframe = pd.DataFrame.from_dict(nomes_tamanho, orient="index").reset_index()

# Alterando o nome das colunas
dataframe.columns = ['NOME','TAMANHO']

# Ordenando por tamanho de nome decrescente
df = dataframe.sort_values(by='TAMANHO',ascending=False)

# Visualizando o dataframe
df

         NOME  TAMANHO
11  adalberto        9
18   vinicius        8
16   fernando        8
13    adriana        7
14    augusto        7
2     ricardo        7
3     roberto        7
23    juliana        7
8     manoela        7
9     eduardo        7
22     andrea        6
21     camila        6
15     felipe        6
0      manoel        6
12     anibal        6
6      tereza        6
4      thiago        6
1       paulo        5
17      apolo        5
19      andre        5
5       sofia        5
24      italo        5
10       josé        4
7         ana        3
20        any        3
25        max        3

2.2.2 - Listando os nomes que tenham tamanho menor ou igual a 5

In [ ]:
df[df['TAMANHO']<=5]

     NOME  TAMANHO
1   paulo        5
17  apolo        5
19  andre        5
5   sofia        5
24  italo        5
10   josé        4
7     ana        3
20    any        3
25    max        3

2.2.3 Mostrando a quantidade de nomes com tamanho menor ou igual a 5

In [ ]:
# Contar e somar a quantidade de nomes com tamanho menor ou igual a 5
soma_nomes_menor_igual_5 = df[df['TAMANHO']<=5].value_counts().sum()

# Imprimindo o resultado
print('O dicionário possue '+str(soma_nomes_menor_igual_5)+' nomes com tamanho menor ou igual a 5')

O dicionário possue 9 nomes com tamanho menor ou igual a 5